package view.constants;


public class MainConstants {
    public static final String AUTHORS[] = {
         "Laura Tobon Ospina", 
         "Juan David Arismendy Pulgarin" };
    
    public static final String SUBTITLE="Trabajo realizado por: ";

    public static final String MAIN_MENU_OPTIONS[] = {
         "[~] Seleccione alguna opcion!", 
         "[1] - Ingresar el polinomio.",
         "[2] - Mostrar el polinomio.", 
         "[3] - Ingresar la matriz.", 
         "[4] - Mostrar la matriz.",
         "[5] - Evaluar el polinomio(d) en términos del tiempo(t).", 
         "[.] - Salir." };

    public static final String ERROR = 
        "[!] Ingrese una opcion correcta!";

        
    public static final String LOGO = """
    ███╗░░░███╗░█████╗░████████╗██████╗░██╗░█████╗░███████╗░██████╗
    ████╗░████║██╔══██╗╚══██╔══╝██╔══██╗██║██╔══██╗██╔════╝██╔════╝
    ██╔████╔██║███████║░░░██║░░░██████╔╝██║██║░░╚═╝█████╗░░╚█████╗░
    ██║╚██╔╝██║██╔══██║░░░██║░░░██╔══██╗██║██║░░██╗██╔══╝░░░╚═══██╗
    ██║░╚═╝░██║██║░░██║░░░██║░░░██║░░██║██║╚█████╔╝███████╗██████╔╝
    ╚═╝░░░░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░╚═╝░░╚═╝╚═╝░╚════╝░╚══════╝╚═════╝░
    """;

    public static final String LOGO2 = """
     🅼 🅰 🆃 🆁 🅸 🅲 🅴 🆂""";
        
    public static final String LOGO3 = """
    █▀▄▀█ ▄▀█ ▀█▀ █▀█ █ █▀▀ █▀▀ █▀
    █░▀░█ █▀█ ░█░ █▀▄ █ █▄▄ ██▄ ▄█
    """;


}

// 🅜🅐🅣🅡🅘🅒🅔🅢